chat_system_919521096_actor_description=Chief Engineer Debat. Dwarf.
chat_system_919521096_snap_1_question=^?^I don't know why you'd need to go there. Elves start to tremble like a granite slab under a steam hammer's strokes at the bare mention of that place...<br>And the place isn't locked by an ordinary key, but by a system of highly complicated catch gears, which can be unlocked only by one key. And that's not even a key at all, but a special mechanical device...
chat_system_919521096_snap_1_answer_0=^?^Then I need this key... or device!
chat_system_919521096_snap_2_question=^?^That's the problem... The key was stolen. And not just the key! The best specialists, best brains of Mehgard, with all their designs and inventions, were all kidnapped by those damned orcs!<br>But the worst thing is that the Portal is open again! Ancient evil, which dwarven mothers used to scare their children, has returned to our world, many hundreds of centuries later! Our factories work at full stretch producing machinery of war. And it's all because of those damned orcs!
chat_system_919521096_snap_2_answer_0=^?^What's happened? How did the orcs get to Mehgard?
chat_system_919521096_snap_3_question=^?^Curiously enough, by ruse and deception. They came to us to offer a grand project - to connect Kordar and Murock by underwater tunnel, like Creiston Mines connect Darion and Kordar. Speaking with strange authority, they demanded from me the ten best engineers of every type. Of course, we couldn't agree, but we were... scared enough by the look of these horrible grinning snouts and sharp swords...<br>So I demanded gold for every engineer. The amount of gold equal to the specialist's weight. Of course, they didn't have enough gold, so I thought that they'd make sail. But it was only a hope - they did not leave...<br>When night fell, the orcs killed all the guards, and kidnapped the engineers and everything they could find in their houses. All valuable records, unique drafts and even portal keys!
chat_system_919521096_snap_3_answer_0=^?^So is the key from Dragons' Labyrinth with the orcs now?
chat_system_919521096_snap_4_question=^?^No. The orcs escaped with everything they stole, along with all our best engineers, but there's just one way from Mehgard, and there they were met by our troops.<br>Retreating, the orcs somehow wandered into the forbidden lands, where the Magic Portal is situated. I have no idea how it could come into their minds to open the Portal, or how they managed to use the right key...<br>...So, when our troops met the demons, the orcs escaped, leaving with everything that might have prevented them from retreating, including the portal keys. Eventually the demons found the keys, and took them to Demonis at once - as if they instantly knew what had fallen into their clutches.<br>So your key and the portal key is on the other side of the portal, with the demons in Nexy or Magnis. We should thank the orcs for that. And we can also thank them for the fact that our best engineers are lost, and the demons have returned to the lands of Kordar.<br>You must go through the Portal, to find your key in Demonis. Me and all the dwarves would be very grateful to you if you'd also find the key for the Portal itself, for there's no other way to close it. Except perhaps by destroying it with a Great Explosion. But that might destroy the whole of Endoria as well, and we can't risk it...
chat_system_919521096_snap_4_answer_0=^?^Ok, I'll find your key as well.
chat_system_919521096_snap_4_answer_1=^?^I need to think...
chat_system_919521096_snap_5_question=^?^Fine! Understand this, human - if the demons are not stopped, they'll conquer Kordar first and then move on to the others! They have already come to Darion lands once, as you must have heard...<br>As soon as you find the key, come to me immediately, and we will seal this damned Portal and destroy the key. It's not going to be easy in Demonis, so first visit my armory. I've prepared some things for you there, useful things... Exclusive technologies, one might say!
chat_system_919521096_snap_5_answer_0=^?^Ok, I see, I'll find your keys.
chat_system_919521096_snap_0_question=^?^Come in, come in... How are you getting along? Have you already been to Demonis?
chat_system_919521096_snap_0_answer_0=^?^Yes, about your offer about the key... I'm going to look for the Portal Key for you!
